# Q. 최소값이 각행 몇열에 있는지

a = [
[3, 23, 85, 34, 17, 74, 25, 52, 65] ,
[10, 7, 39, 42, 88, 52, 14, 72, 63] ,
[87, 42, 18, 78, 53, 45, 18, 84, 53],
[34, 28, 64, 85, 12, 16, 75, 36, 55],
[21, 77, 45, 35, 28, 75, 90, 76, 1],
[25, 87, 65, 15, 28, 11, 37, 28, 74],
[65, 27, 75, 41, 7, 89, 78, 64, 39],
[47, 47, 70, 45, 23, 65, 3, 41, 44],
[87, 13, 82, 38, 31, 12, 29, 29, 80]
]
row_number = 0
for row in a :
    row_number += 1
    min_num = min(row)
    answer = f"{row_number}행의 최소값은 {min_num}이고 "
    for i in range(0, len(row)):
        if min_num == row[i] :
            answer += f"{str(i + 1)} " #i=0+1 "1"
    print(answer + "열에 있다.")