# 1시간은 혼자 풀어보고 1~2
# 1시간 회의 해서 2~3
# 30분 3 ~3.5
a = [
[3, 23, 85, 34, 17, 74, 25, 52, 65] ,
[10, 7, 39, 42, 88, 52, 14, 72, 63] ,
[87, 42, 18, 78, 53, 45, 18, 84, 53],
[34, 28, 64, 85, 12, 16, 75, 36, 55],
[21, 77, 45, 35, 28, 75, 90, 76, 1],
[25, 87, 65, 15, 28, 11, 37, 28, 74],
[65, 27, 75, 41, 7, 89, 78, 64, 39],
[47, 47, 70, 45, 23, 65, 3, 41, 44],
[87, 13, 82, 38, 31, 12, 29, 29, 80]
]

# 각행 소수 개수  4
# 최대값이 각행 몇열에 있는지	3
# 최소값이 각행 몇열에 있는지	1
# 열에 합으로 가장 큰 열 과 그 수	2
# 각행 소수 개수  4
# 1. 하나부터 소수 
# 2. 리스트에서 소수 개수 구하기
# 3. 많은 리스트에서 각각 소수 개수 구하기 


# 최대값이 각행 몇열에 있는지	3
# 1. 하나의 리스트부터 최대값 구하기
# 2. 하나의 리스트부터 어디에 최대값이 있는지 
# 3. 각 리스트에서 최대값을 어디에 구하기


# 최소값이 각행 몇열에 있는지	1
# 1. 하나의 리스트부터 최소값 구하기
# 2. 하나의 리스트부터 어디에 최소값이 있는지 
# 3. 각 리스트에서 최소값을 어디에 구하기

# 열에 합으로 가장 큰 열 과 그 수	2
# 1. 하나의 리스트에 합
# 2. 각 리스트의 합을 구하기
# 3. 어디가 가장 큰지 
